
## Plans :heavy_multiplication_x:
 
Outputs can be viewed in the Terrateam Console [here](https://app.terrateam.io/i/90314100/runs/be931a62-247b-4160-962d-5c9e8d71fcb8).

Running plans **FAILED**.  See **Terrateam Plan Output**.

After resolving the issue, run `terrateam plan` to execute the plan operation again.

## Terrateam Plan Output :heavy_multiplication_x:
<details>
  <summary>Expand for plan output details</summary>

## Dir: . | :heavy_multiplication_x:
**Dir**: .
**Workspace**: default
**Success**: :heavy_multiplication_x:

**Step**: update-terrateam-github-token
**Success**: :thumbsup:

```

```

**Step**: init
**Success**: :thumbsup:

```
Initializing the backend...
Initializing modules...
Initializing provider plugins...
- terraform.io/builtin/terraform is built in to Terraform
- Finding bpg/proxmox versions matching "0.84.***"...
- Installing bpg/proxmox v0.84.***...
- Installed bpg/proxmox v0.84.*** (self-signed, key ID F0582AD6AE97C***88)
Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://developer.hashicorp.com/terraform/cli/plugins/signing
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

```

**Step**: plan
**Success**: :heavy_multiplication_x:

```
╷
│ Error: Unable to find remote state
│ 
│   with data.terraform_remote_state.installer,
│   on data.tf line ***, in data "terraform_remote_state" "installer":
│    ***: data "terraform_remote_state" "installer" {
│ 
│ No stored state was found for the given workspace in the given backend.
╵

data.terraform_remote_state.installer: Reading...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.image_factory["jammy"].proxmox_virtual_environment_download_file.download will be created
  + resource "proxmox_virtual_environment_download_file" "download" {
      + content_type        = "iso"
      + datastore_id        = "local"
      + file_name           = "jammy-server-cloudimg-amd64.qcow2.img"
      + id                  = (known after apply)
      + node_name           = "frodo"
      + overwrite           = true
      + overwrite_unmanaged = false
      + size                = (known after apply)
      + upload_timeout      = 600
      + url                 = "https://cloud-images.ubuntu.com/jammy/current/jammy-server-cloudimg-amd64.img"
      + verify              = true
    }

  # module.image_factory["noble"].proxmox_virtual_environment_download_file.download will be created
  + resource "proxmox_virtual_environment_download_file" "download" {
      + content_type        = "iso"
      + datastore_id        = "local"
      + file_name           = "noble-server-cloudimg-amd64.qcow2.img"
      + id                  = (known after apply)
      + node_name           = "frodo"
      + overwrite           = true
      + overwrite_unmanaged = false
      + size                = (known after apply)
      + upload_timeout      = 600
      + url                 = "https://cloud-images.ubuntu.com/noble/current/noble-server-cloudimg-amd64.img"
      + verify              = true
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + image_factory = {
      + jammy = (known after apply)
      + noble = (known after apply)
    }
Failure during /github/home/.tenv/Terraform/***.***3.4/terraform call : exited with code ***

```

</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>